<?php

// 1
ini_set('display_errors', 1);
error_reporting(E_ALL);

// 2
define('ROOT', dirname(__FILE__));
require_once(ROOT.'/components/Router.php');

// 3
$router = new Router();
$router->run();
// Router::run(); // альтернативный вызов статического метода тоже работает

/*
1 - Подключение отображения ошибок
		Не стоит забывать удалять эти строки в рабочем проекте.
	
2 - Подключение файлов
		Для подключения файла используется полный путь к файлу на диске,
	который мы получаем при помощи функции dirname() и псевдо константы __FILE__
	Полученный таким образом путь мы помещаем в константу ROOT	
	
3 - Вызов роутера
		Создается новый экземпляр класса и упраление программой переходит 
	к методу run()
		Если честно то не совсем понятно, почему тут не используется вызов 
	статического метода?
*/