<?php

// Пример работы функции preg_replace()

$string = '15-12-2016'; // 1

$pattern = '/([0-9]{2})-([0-9]{2})-([0-9]{4})/'; // 2

$replacement = 'Год $3, Месяц $2, День $1'; // 3

echo 'было - ' . $string;
echo ', стало - ' . preg_replace($pattern, $replacement, $string); // 4

/*
1) строку '15-12-2016' нам нужно превратить в - 'год 2016, месяц 12, число 15-12-2016'

2) описываем строку '15-12-2016' при помощи регулярного выражения:
// ([цифры от 0 до 9]{две штуки})- и т.д. 

3) описываем то, какой результат мы хотим видеть
$3, $2, $1 - символизируют подмаски из регулярного выражения
* ПОДМАСКИ ОГРАНИЧИВАЮТСЯ КРУГЛЫМИ СКОБКАМИ

функция выплняет поиск по строке $string, по специальному регулярному 
выражению $pattern. если совпадения найдены, функция производит замену
в строке $replacement
*/

