<?php

return array (
	
	// news/sport/114
	'news/([a-z]+)/([0-9]+)' => 'news/view/$1/$2',	
	
	/*
	'news/([0-9]+)' => 'news/view',	
	'news' => 'news/index', // Будет отвечать за список новостей
	*/
);

/*
	Так как класс роутер по очереди проходи по массиву и применяет 
первое правило в котором совпадает запрос то такие правила
'news/77' => 'news/view' мы должны расположить выше, что-бы они работали

([0-9]+) - в строке может содержаться любое число от одного символа


Передача параметров при использовании ЧПУ (Задача, - передать методу view.. конкретный ИД и Категорию):

Без использования ЧПУ:
http://test2/news/?id=1235&category=sport -> такой запрос попадет в суперглобальный массив $_GET
И мы можем получить значения по ключам, - $_GET['id'] и $_GET['category']

С использованием ЧПУ:
Рссмотрим передачу параметров из вот такого запроса:
http://test2/news/sport/12345

*/